<?xml version="1.0" ?>
<net batch="1" name="sn" version="4">
	<layers>
		<layer id="0" name="input_1" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="shufflenet/conv1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="2592"/>
			</blobs>
		</layer>
		<layer id="2" name="shufflenet/conv1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="shufflenet/maxpool1/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="1,1" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="shufflenet/stage2/block1/1x1conv_1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="116" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>116</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2592" size="11136"/>
				<biases offset="13728" size="464"/>
			</blobs>
		</layer>
		<layer id="5" name="shufflenet/stage2/block1/relu_1x1conv_1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="shufflenet/stage2/block1/3x3dwconv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="116" kernel="3,3" output="116" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="14192" size="4176"/>
				<biases offset="18368" size="464"/>
			</blobs>
		</layer>
		<layer id="7" name="shufflenet/stage2/block1/1x1conv_2/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="116" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="18832" size="53824"/>
				<biases offset="72656" size="464"/>
			</blobs>
		</layer>
		<layer id="8" name="shufflenet/stage2/block1/relu_1x1conv_2/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="shufflenet/stage2/block1/3x3dwconv_2/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="24" kernel="3,3" output="24" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="73120" size="864"/>
				<biases offset="73984" size="96"/>
			</blobs>
		</layer>
		<layer id="10" name="shufflenet/stage2/block1/1x1_conv_3/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="116" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="74080" size="11136"/>
				<biases offset="85216" size="464"/>
			</blobs>
		</layer>
		<layer id="11" name="shufflenet/stage2/block1/relu_1x1conv_3/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="shufflenet/stage2/block1/concat_2/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="shufflenet/stage2/block1/channel_shuffle/Reshape" precision="FP32" type="Reshape">
			<data dim="1,64,64,2,116"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>116</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="shufflenet/stage2/block1/channel_shuffle/transpose" precision="FP32" type="Permute">
			<data order="0,2,1,3"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>116</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>2</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="shufflenet/stage2/block1/channel_shuffle/Reshape_1" precision="FP32" type="Reshape">
			<data dim="1,232,64,64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>2</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="shufflenet/stage2/block2/spl/sp0_slice/strided_slice/Split" precision="FP32" type="Split">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="shufflenet/stage2/block2/1x1conv_1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="116" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="85680" size="53824"/>
				<biases offset="139504" size="464"/>
			</blobs>
		</layer>
		<layer id="18" name="shufflenet/stage2/block2/relu_1x1conv_1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="shufflenet/stage2/block2/3x3dwconv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="116" kernel="3,3" output="116" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="139968" size="4176"/>
				<biases offset="144144" size="464"/>
			</blobs>
		</layer>
		<layer id="20" name="shufflenet/stage2/block2/1x1conv_2/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="116" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="144608" size="53824"/>
				<biases offset="198432" size="464"/>
			</blobs>
		</layer>
		<layer id="21" name="shufflenet/stage2/block2/relu_1x1conv_2/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="shufflenet/stage2/block2/concat_1/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="shufflenet/stage2/block2/channel_shuffle/Reshape" precision="FP32" type="Reshape">
			<data dim="1,64,64,2,116"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>116</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="shufflenet/stage2/block2/channel_shuffle/transpose" precision="FP32" type="Permute">
			<data order="0,2,1,3"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>116</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>2</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="shufflenet/stage2/block2/channel_shuffle/Reshape_1" precision="FP32" type="Reshape">
			<data dim="1,232,64,64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>2</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="shufflenet/stage2/block3/spl/sp1_slice/strided_slice/Split" precision="FP32" type="Split">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="shufflenet/stage2/block3/1x1conv_1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="116" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="198896" size="53824"/>
				<biases offset="252720" size="464"/>
			</blobs>
		</layer>
		<layer id="28" name="shufflenet/stage2/block3/relu_1x1conv_1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="shufflenet/stage2/block3/3x3dwconv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="116" kernel="3,3" output="116" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="253184" size="4176"/>
				<biases offset="257360" size="464"/>
			</blobs>
		</layer>
		<layer id="30" name="shufflenet/stage2/block3/1x1conv_2/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="116" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="257824" size="53824"/>
				<biases offset="311648" size="464"/>
			</blobs>
		</layer>
		<layer id="31" name="shufflenet/stage2/block3/relu_1x1conv_2/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="shufflenet/stage2/block3/concat_1/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="shufflenet/stage2/block3/channel_shuffle/Reshape" precision="FP32" type="Reshape">
			<data dim="1,64,64,2,116"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>116</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="shufflenet/stage2/block3/channel_shuffle/transpose" precision="FP32" type="Permute">
			<data order="0,2,1,3"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>116</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>2</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="shufflenet/stage2/block3/channel_shuffle/Reshape_1" precision="FP32" type="Reshape">
			<data dim="1,232,64,64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>2</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="shufflenet/stage2/block4/spl/sp0_slice/strided_slice/Split" precision="FP32" type="Split">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="shufflenet/stage2/block4/1x1conv_1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="116" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="312112" size="53824"/>
				<biases offset="365936" size="464"/>
			</blobs>
		</layer>
		<layer id="38" name="shufflenet/stage2/block4/relu_1x1conv_1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="shufflenet/stage2/block4/3x3dwconv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="116" kernel="3,3" output="116" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="366400" size="4176"/>
				<biases offset="370576" size="464"/>
			</blobs>
		</layer>
		<layer id="40" name="shufflenet/stage2/block4/1x1conv_2/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="116" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="371040" size="53824"/>
				<biases offset="424864" size="464"/>
			</blobs>
		</layer>
		<layer id="41" name="shufflenet/stage2/block4/relu_1x1conv_2/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="shufflenet/stage2/block4/concat_1/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="shufflenet/stage2/block4/channel_shuffle/Reshape" precision="FP32" type="Reshape">
			<data dim="1,64,64,2,116"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>116</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="shufflenet/stage2/block4/channel_shuffle/transpose" precision="FP32" type="Permute">
			<data order="0,2,1,3"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>116</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>2</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="shufflenet/stage2/block4/channel_shuffle/Reshape_1" precision="FP32" type="Reshape">
			<data dim="1,232,64,64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>2</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="shufflenet/stage3/block1/1x1conv_1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="232" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="425328" size="215296"/>
				<biases offset="640624" size="928"/>
			</blobs>
		</layer>
		<layer id="47" name="shufflenet/stage3/block1/relu_1x1conv_1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="shufflenet/stage3/block1/3x3dwconv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="232" kernel="3,3" output="232" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="641552" size="8352"/>
				<biases offset="649904" size="928"/>
			</blobs>
		</layer>
		<layer id="49" name="shufflenet/stage3/block1/1x1conv_2/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="232" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="650832" size="215296"/>
				<biases offset="866128" size="928"/>
			</blobs>
		</layer>
		<layer id="50" name="shufflenet/stage3/block1/relu_1x1conv_2/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="shufflenet/stage3/block1/3x3dwconv_2/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="232" kernel="3,3" output="232" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="867056" size="8352"/>
				<biases offset="875408" size="928"/>
			</blobs>
		</layer>
		<layer id="52" name="shufflenet/stage3/block1/1x1_conv_3/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="232" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="876336" size="215296"/>
				<biases offset="1091632" size="928"/>
			</blobs>
		</layer>
		<layer id="53" name="shufflenet/stage3/block1/relu_1x1conv_3/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="shufflenet/stage3/block1/concat_2/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="shufflenet/stage3/block1/channel_shuffle/Reshape" precision="FP32" type="Reshape">
			<data dim="1,32,32,2,232"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>232</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="shufflenet/stage3/block1/channel_shuffle/transpose" precision="FP32" type="Permute">
			<data order="0,2,1,3"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>232</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="shufflenet/stage3/block1/channel_shuffle/Reshape_1" precision="FP32" type="Reshape">
			<data dim="1,464,32,32"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="shufflenet/stage3/block2/spl/sp1_slice/strided_slice/Split" precision="FP32" type="Split">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="shufflenet/stage3/block2/1x1conv_1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="232" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1092560" size="215296"/>
				<biases offset="1307856" size="928"/>
			</blobs>
		</layer>
		<layer id="60" name="shufflenet/stage3/block2/relu_1x1conv_1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="shufflenet/stage3/block2/3x3dwconv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="232" kernel="3,3" output="232" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1308784" size="8352"/>
				<biases offset="1317136" size="928"/>
			</blobs>
		</layer>
		<layer id="62" name="shufflenet/stage3/block2/1x1conv_2/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="232" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1318064" size="215296"/>
				<biases offset="1533360" size="928"/>
			</blobs>
		</layer>
		<layer id="63" name="shufflenet/stage3/block2/relu_1x1conv_2/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="shufflenet/stage3/block2/concat_1/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="shufflenet/stage3/block2/channel_shuffle/Reshape" precision="FP32" type="Reshape">
			<data dim="1,32,32,2,232"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>232</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="shufflenet/stage3/block2/channel_shuffle/transpose" precision="FP32" type="Permute">
			<data order="0,2,1,3"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>232</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="shufflenet/stage3/block2/channel_shuffle/Reshape_1" precision="FP32" type="Reshape">
			<data dim="1,464,32,32"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="shufflenet/stage3/block3/spl/sp1_slice/strided_slice/Split" precision="FP32" type="Split">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="shufflenet/stage3/block3/1x1conv_1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="232" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1534288" size="215296"/>
				<biases offset="1749584" size="928"/>
			</blobs>
		</layer>
		<layer id="70" name="shufflenet/stage3/block3/relu_1x1conv_1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="shufflenet/stage3/block3/3x3dwconv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="232" kernel="3,3" output="232" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1750512" size="8352"/>
				<biases offset="1758864" size="928"/>
			</blobs>
		</layer>
		<layer id="72" name="shufflenet/stage3/block3/1x1conv_2/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="232" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1759792" size="215296"/>
				<biases offset="1975088" size="928"/>
			</blobs>
		</layer>
		<layer id="73" name="shufflenet/stage3/block3/relu_1x1conv_2/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="shufflenet/stage3/block3/concat_1/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="shufflenet/stage3/block3/channel_shuffle/Reshape" precision="FP32" type="Reshape">
			<data dim="1,32,32,2,232"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>232</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="shufflenet/stage3/block3/channel_shuffle/transpose" precision="FP32" type="Permute">
			<data order="0,2,1,3"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>232</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="shufflenet/stage3/block3/channel_shuffle/Reshape_1" precision="FP32" type="Reshape">
			<data dim="1,464,32,32"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="shufflenet/stage3/block4/spl/sp1_slice/strided_slice/Split" precision="FP32" type="Split">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="shufflenet/stage3/block4/1x1conv_1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="232" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1976016" size="215296"/>
				<biases offset="2191312" size="928"/>
			</blobs>
		</layer>
		<layer id="80" name="shufflenet/stage3/block4/relu_1x1conv_1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="shufflenet/stage3/block4/3x3dwconv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="232" kernel="3,3" output="232" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2192240" size="8352"/>
				<biases offset="2200592" size="928"/>
			</blobs>
		</layer>
		<layer id="82" name="shufflenet/stage3/block4/1x1conv_2/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="232" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2201520" size="215296"/>
				<biases offset="2416816" size="928"/>
			</blobs>
		</layer>
		<layer id="83" name="shufflenet/stage3/block4/relu_1x1conv_2/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="shufflenet/stage3/block4/concat_1/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="shufflenet/stage3/block4/channel_shuffle/Reshape" precision="FP32" type="Reshape">
			<data dim="1,32,32,2,232"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>232</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="shufflenet/stage3/block4/channel_shuffle/transpose" precision="FP32" type="Permute">
			<data order="0,2,1,3"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>232</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="shufflenet/stage3/block4/channel_shuffle/Reshape_1" precision="FP32" type="Reshape">
			<data dim="1,464,32,32"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="shufflenet/stage3/block5/spl/sp0_slice/strided_slice/Split" precision="FP32" type="Split">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="shufflenet/stage3/block5/1x1conv_1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="232" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2417744" size="215296"/>
				<biases offset="2633040" size="928"/>
			</blobs>
		</layer>
		<layer id="90" name="shufflenet/stage3/block5/relu_1x1conv_1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="shufflenet/stage3/block5/3x3dwconv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="232" kernel="3,3" output="232" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2633968" size="8352"/>
				<biases offset="2642320" size="928"/>
			</blobs>
		</layer>
		<layer id="92" name="shufflenet/stage3/block5/1x1conv_2/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="232" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2643248" size="215296"/>
				<biases offset="2858544" size="928"/>
			</blobs>
		</layer>
		<layer id="93" name="shufflenet/stage3/block5/relu_1x1conv_2/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="shufflenet/stage3/block5/concat_1/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="shufflenet/stage3/block5/channel_shuffle/Reshape" precision="FP32" type="Reshape">
			<data dim="1,32,32,2,232"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>232</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="shufflenet/stage3/block5/channel_shuffle/transpose" precision="FP32" type="Permute">
			<data order="0,2,1,3"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>232</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="shufflenet/stage3/block5/channel_shuffle/Reshape_1" precision="FP32" type="Reshape">
			<data dim="1,464,32,32"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="shufflenet/stage3/block6/spl/sp1_slice/strided_slice/Split" precision="FP32" type="Split">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>464</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="shufflenet/stage3/block6/1x1conv_1/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="232" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2859472" size="215296"/>
				<biases offset="3074768" size="928"/>
			</blobs>
		</layer>
		<layer id="100" name="shufflenet/stage3/block6/relu_1x1conv_1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="shufflenet/stage3/block6/3x3dwconv/depthwise" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="232" kernel="3,3" output="232" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3075696" size="8352"/>
				<biases offset="3084048" size="928"/>
			</blobs>
		</layer>
		<layer id="102" name="shufflenet/stage3/block6/1x1conv_2/convolution" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="232" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3084976" size="215296"/>
